# vim: set filetype=ruby :
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "abduco"
brew "bash"
brew "bash-completion@2"
brew "black"
brew "btop"
brew "ca-certificates"
brew "ctags"
brew "exiftool"
brew "ffmpeg"
brew "flac"
brew "git-lfs"
brew "gitui"
brew "go"
brew "htop"
brew "lame"
brew "ipcalc"
brew "isync"
brew "jq"
brew "mypy"
brew "pandoc"
brew "pssh"
brew "pstree"
brew "python"
brew "python-packaging"
brew "pyyaml"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "shfmt"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"
brew "zellij"

cask "font-dejavu"
cask "font-hack"
cask "font-input"

RestrictedItems = {
  "mactex-no-gui" => {
    :type => :cask,
    :sudo => true,
    :work => false,
  },
  "lookaway" => {
    :type => :cask,
    :sudo => true,
    :work => true,
  },
}

CanSudo = (Process.gid == 80) || (Process.groups.include? 80)
IsWork = ["/Library/HDS", "/usr/local/hitachi", "/usr/local/jamf"].any? { |d| File.exist? d }

RestrictedItems.each() { |name,details|
  if details[:sudo] && !CanSudo
    $stderr.puts("Warning: Not installing #{name} which needs sudo")
    next
  end
  if details[:work] && !IsWork
    next
  end
  send(details[:type], name)
}
