tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "abduco"
brew "bash"
brew "bash-completion@2"
brew "ca-certificates"
brew "ctags"
brew "exiftool"
brew "ffmpeg"
brew "flac"
brew "go"
brew "lame"
brew "ipcalc"
brew "isync"
brew "jq"
brew "pstree"
brew "python"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "vim"
brew "watch"
brew "youtube-dl"

cask "font-dejavu"
cask "font-hack"
cask "font-input"
