# vim: set filetype=ruby :
tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "abduco"
brew "bash"
brew "black"
brew "bash-completion@2"
brew "ca-certificates"
brew "ctags"
brew "exiftool"
brew "ffmpeg"
brew "flac"
brew "git-lfs"
brew "gitui"
brew "go"
brew "lame"
brew "ipcalc"
brew "isync"
brew "jq"
brew "mypy"
brew "pandoc"
brew "pssh"
brew "pstree"
brew "python"
brew "python-packaging"
brew "pyyaml"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "vim"
brew "watch"
brew "wget"
brew "youtube-dl"

cask "font-dejavu"
cask "font-hack"
cask "font-input"

# MacTex may need to sudo, so have to be in group admin(80)
if (Process.gid == 80) || (Process.groups.include? 80)
    cask "mactex-no-gui"
else
    $stderr.puts("Warning: Not installing mactex-no-gui which needs sudo")
end
